src/Catalogs/СерверыLLM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СерверыLLM</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСервера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСерверовLLM</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СерверыLLM/Ext/ManagerModule.bsl
Функция АдресСервераДляЗапросов(ВыбранныйСерверLLM) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ВыбранныйСерверLLM);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СерверыLLM.Сервер КАК Сервер,
	|	СерверыLLM.Порт КАК Порт
	|ИЗ
	|	Справочник.СерверыLLM КАК СерверыLLM
	|ГДЕ
	|	СерверыLLM.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат СтрШаблон("%1:%2", Выборка.Сервер, XMLСтрока(Выборка.Порт));
		
		
	КонецЕсли;
	
	ВызватьИсключение "Не смог сформировать строку подключения к серверу";

КонецФункции
